cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Mfdr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Mfsr;
  Mfsr.setOpcode(AVR32::MFSRi);
  Mfsr.addOperand(MCOperand::createReg(AVR32::R1));
  Mfsr.addOperand(MCOperand::createImm(4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Mfsr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe1);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst MulCompact;
  MulCompact.setOpcode(AVR32::MULrr);
  MulCompact.addOperand(MCOperand::createReg(AVR32::R1));
  MulCompact.addOperand(MCOperand::createReg(AVR32::R2));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MulCompact, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xa5);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst MulImm;
  MulImm.setOpcode(AVR32::MULri8);
  MulImm.addOperand(MCOperand::createReg(AVR32::R1));
  MulImm.addOperand(MCOperand::createReg(AVR32::R2));
  MulImm.addOperand(MCOperand::createImm(-1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MulImm, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x01);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x10);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0xff);

  MCInst Mul;
  Mul.setOpcode(AVR32::MULrrr);
  Mul.addOperand(MCOperand::createReg(AVR32::R1));
  Mul.addOperand(MCOperand::createReg(AVR32::R2));
  Mul.addOperand(MCOperand::createReg(AVR32::R3));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Mul, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe4);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x03);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x02);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x41);

  MCInst MulsD;
  MulsD.setOpcode(AVR32::MULS_Drrr);
  MulsD.addOperand(MCOperand::createReg(AVR32::R2));
  MulsD.addOperand(MCOperand::createReg(AVR32::R3));
  MulsD.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MulsD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x42);

  MCInst MuluD;
  MuluD.setOpcode(AVR32::MULU_Drrr);
  MuluD.addOperand(MCOperand::createReg(AVR32::R2));
  MuluD.addOperand(MCOperand::createReg(AVR32::R3));
  MuluD.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(MuluD, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x06);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x42);

  MCInst Divs;
  Divs.setOpcode(AVR32::DIVSrrr);
  Divs.addOperand(MCOperand::createReg(AVR32::R2));
  Divs.addOperand(MCOperand::createReg(AVR32::R3));
  Divs.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Divs, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0c);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst Divu;
  Divu.setOpcode(AVR32::DIVUrrr);
  Divu.addOperand(MCOperand::createReg(AVR32::R2));
  Divu.addOperand(MCOperand::createReg(AVR32::R3));
  Divu.addOperand(MCOperand::createReg(AVR32::R4));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Divu, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe6);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x04);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x0d);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x02);

  MCInst Musfr;
  Musfr.setOpcode(AVR32::MUSFRr);
  Musfr.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Musfr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5d);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x31);

  MCInst Mustr;
  Mustr.setOpcode(AVR32::MUSTRr);
  Mustr.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Mustr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 2u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0x5d);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0x21);

  MCInst Mtdr;
  Mtdr.setOpcode(AVR32::MTDRi);
  Mtdr.addOperand(MCOperand::createImm(4));
  Mtdr.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Mtdr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe7);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Mtsr;
  Mtsr.setOpcode(AVR32::MTSRi);
  Mtsr.addOperand(MCOperand::createImm(4));
  Mtsr.addOperand(MCOperand::createReg(AVR32::R1));

  Code.clear();
  Fixups.clear();
  MCE->encodeInstruction(Mtsr, Code, Fixups, *STI);

  EXPECT_TRUE(Fixups.empty());
  ASSERT_EQ(Code.size(), 4u);
  EXPECT_EQ(static_cast<uint8_t>(Code[0]), 0xe3);
  EXPECT_EQ(static_cast<uint8_t>(Code[1]), 0xb1);
  EXPECT_EQ(static_cast<uint8_t>(Code[2]), 0x00);
  EXPECT_EQ(static_cast<uint8_t>(Code[3]), 0x01);

  MCInst Or;
  Or.setOpcode(AVR32::ORrr);
  Or.addOperand(MCOperand::createReg(AVR32::R1));
  Or.addOperand(MCOperand::createReg(AVR32::R2));

