cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream AndhCOHOS(Printed);
  InstPrinter->printInst(&AndhCOH, /*Address=*/0, /*Annot=*/"", *STI,
                         AndhCOHOS);
  AndhCOHOS.flush();
  EXPECT_EQ(Printed, "\tandh\tr1, 1, coh");

  Printed.clear();
  raw_string_ostream AndlOS(Printed);
  InstPrinter->printInst(&Andl, /*Address=*/0, /*Annot=*/"", *STI, AndlOS);
  AndlOS.flush();
  EXPECT_EQ(Printed, "\tandl\tr1, 1");

  Printed.clear();
  raw_string_ostream AndlCOHOS(Printed);
  InstPrinter->printInst(&AndlCOH, /*Address=*/0, /*Annot=*/"", *STI,
                         AndlCOHOS);
  AndlCOHOS.flush();
  EXPECT_EQ(Printed, "\tandl\tr1, 1, coh");

  Printed.clear();
  raw_string_ostream AndEqOS(Printed);
  InstPrinter->printInst(&AndEq, /*Address=*/0, /*Annot=*/"", *STI, AndEqOS);
  AndEqOS.flush();
  EXPECT_EQ(Printed, "\tandeq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AndAlOS(Printed);
  InstPrinter->printInst(&AndAl, /*Address=*/0, /*Annot=*/"", *STI, AndAlOS);
  AndAlOS.flush();
  EXPECT_EQ(Printed, "\tandal\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream AndnOS(Printed);
  InstPrinter->printInst(&Andn, /*Address=*/0, /*Annot=*/"", *STI, AndnOS);
  AndnOS.flush();
  EXPECT_EQ(Printed, "\tandn\tr1, r2");

  Printed.clear();
  raw_string_ostream AsrOS(Printed);
  InstPrinter->printInst(&Asr, /*Address=*/0, /*Annot=*/"", *STI, AsrOS);
  AsrOS.flush();
  EXPECT_EQ(Printed, "\tasr\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream BldOS(Printed);
  InstPrinter->printInst(&Bld, /*Address=*/0, /*Annot=*/"", *STI, BldOS);
  BldOS.flush();
  EXPECT_EQ(Printed, "\tbld\tr1, 1");

  Printed.clear();
  raw_string_ostream BrevOS(Printed);
  InstPrinter->printInst(&Brev, /*Address=*/0, /*Annot=*/"", *STI, BrevOS);
  BrevOS.flush();
  EXPECT_EQ(Printed, "\tbrev\tr1");

  Printed.clear();
  raw_string_ostream BstOS(Printed);
  InstPrinter->printInst(&Bst, /*Address=*/0, /*Annot=*/"", *STI, BstOS);
  BstOS.flush();
  EXPECT_EQ(Printed, "\tbst\tr1, 1");

  Printed.clear();
  raw_string_ostream CbrOS(Printed);
  InstPrinter->printInst(&Cbr, /*Address=*/0, /*Annot=*/"", *STI, CbrOS);
  CbrOS.flush();
  EXPECT_EQ(Printed, "\tcbr\tr1, 1");

  Printed.clear();
  raw_string_ostream BreakpointOS(Printed);
  InstPrinter->printInst(&Breakpoint, /*Address=*/0, /*Annot=*/"", *STI,
                         BreakpointOS);
  BreakpointOS.flush();
  EXPECT_EQ(Printed, "\tbreakpoint");

  Printed.clear();
  raw_string_ostream CastsBOS(Printed);
  InstPrinter->printInst(&CastsB, /*Address=*/0, /*Annot=*/"", *STI, CastsBOS);
  CastsBOS.flush();
  EXPECT_EQ(Printed, "\tcasts.b\tr1");

  Printed.clear();
  raw_string_ostream CastsHOS(Printed);
  InstPrinter->printInst(&CastsH, /*Address=*/0, /*Annot=*/"", *STI, CastsHOS);
  CastsHOS.flush();
  EXPECT_EQ(Printed, "\tcasts.h\tr1");

  Printed.clear();
  raw_string_ostream CastuBOS(Printed);
  InstPrinter->printInst(&CastuB, /*Address=*/0, /*Annot=*/"", *STI, CastuBOS);
  CastuBOS.flush();
  EXPECT_EQ(Printed, "\tcastu.b\tr1");

  Printed.clear();
  raw_string_ostream CastuHOS(Printed);
  InstPrinter->printInst(&CastuH, /*Address=*/0, /*Annot=*/"", *STI, CastuHOS);
  CastuHOS.flush();
  EXPECT_EQ(Printed, "\tcastu.h\tr1");

  Printed.clear();
  raw_string_ostream ComOS(Printed);
  InstPrinter->printInst(&Com, /*Address=*/0, /*Annot=*/"", *STI, ComOS);
  ComOS.flush();
  EXPECT_EQ(Printed, "\tcom\tr1");

  Printed.clear();
  raw_string_ostream CpcOS(Printed);
  InstPrinter->printInst(&Cpc, /*Address=*/0, /*Annot=*/"", *STI, CpcOS);
  CpcOS.flush();
  EXPECT_EQ(Printed, "\tcpc\tr1");

  Printed.clear();
  raw_string_ostream CpcRROS(Printed);
  InstPrinter->printInst(&CpcRR, /*Address=*/0, /*Annot=*/"", *STI,
                         CpcRROS);
  CpcRROS.flush();
  EXPECT_EQ(Printed, "\tcpc\tr1, r2");

  Printed.clear();
  raw_string_ostream ClzOS(Printed);
  InstPrinter->printInst(&Clz, /*Address=*/0, /*Annot=*/"", *STI, ClzOS);
  ClzOS.flush();
  EXPECT_EQ(Printed, "\tclz\tr1, r2");

  Printed.clear();
  raw_string_ostream CpBOS(Printed);
  InstPrinter->printInst(&CpB, /*Address=*/0, /*Annot=*/"", *STI, CpBOS);
  CpBOS.flush();
  EXPECT_EQ(Printed, "\tcp.b\tr1, r2");

  Printed.clear();
  raw_string_ostream CpHOS(Printed);
  InstPrinter->printInst(&CpH, /*Address=*/0, /*Annot=*/"", *STI, CpHOS);
  CpHOS.flush();
  EXPECT_EQ(Printed, "\tcp.h\tr1, r2");

  Printed.clear();
  raw_string_ostream CpWOS(Printed);
  InstPrinter->printInst(&CpW, /*Address=*/0, /*Annot=*/"", *STI, CpWOS);
  CpWOS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, r2");

  Printed.clear();
  raw_string_ostream CpWImmOS(Printed);
  InstPrinter->printInst(&CpWImm, /*Address=*/0, /*Annot=*/"", *STI,
                         CpWImmOS);
  CpWImmOS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, -1");

  Printed.clear();
  raw_string_ostream CpWImm21OS(Printed);
  InstPrinter->printInst(&CpWImm21, /*Address=*/0, /*Annot=*/"", *STI,
                         CpWImm21OS);
  CpWImm21OS.flush();
  EXPECT_EQ(Printed, "\tcp.w\tr1, 32");

  Printed.clear();
  raw_string_ostream CsrfczOS(Printed);
  InstPrinter->printInst(&Csrfcz, /*Address=*/0, /*Annot=*/"", *STI,
                         CsrfczOS);
  CsrfczOS.flush();
  EXPECT_EQ(Printed, "\tcsrfcz\t1");

  Printed.clear();
  raw_string_ostream CsrfOS(Printed);
  InstPrinter->printInst(&Csrf, /*Address=*/0, /*Annot=*/"", *STI, CsrfOS);
  CsrfOS.flush();
  EXPECT_EQ(Printed, "\tcsrf\t1");

  Printed.clear();
  raw_string_ostream NegOS(Printed);
  InstPrinter->printInst(&Neg, /*Address=*/0, /*Annot=*/"", *STI, NegOS);
  NegOS.flush();
  EXPECT_EQ(Printed, "\tneg\tr1");

  Printed.clear();
  raw_string_ostream EorOS(Printed);
  InstPrinter->printInst(&Eor, /*Address=*/0, /*Annot=*/"", *STI, EorOS);
  EorOS.flush();
  EXPECT_EQ(Printed, "\teor\tr1, r2");

  Printed.clear();
  raw_string_ostream EorhOS(Printed);
  InstPrinter->printInst(&Eorh, /*Address=*/0, /*Annot=*/"", *STI, EorhOS);
  EorhOS.flush();
  EXPECT_EQ(Printed, "\teorh\tr1, 1");

  Printed.clear();
  raw_string_ostream EorlOS(Printed);
  InstPrinter->printInst(&Eorl, /*Address=*/0, /*Annot=*/"", *STI, EorlOS);
  EorlOS.flush();
  EXPECT_EQ(Printed, "\teorl\tr1, 1");

