cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream EorEqOS(Printed);
  InstPrinter->printInst(&EorEq, /*Address=*/0, /*Annot=*/"", *STI, EorEqOS);
  EorEqOS.flush();
  EXPECT_EQ(Printed, "\teoreq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream EorAlOS(Printed);
  InstPrinter->printInst(&EorAl, /*Address=*/0, /*Annot=*/"", *STI, EorAlOS);
  EorAlOS.flush();
  EXPECT_EQ(Printed, "\teoral\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream FrsOS(Printed);
  InstPrinter->printInst(&Frs, /*Address=*/0, /*Annot=*/"", *STI, FrsOS);
  FrsOS.flush();
  EXPECT_EQ(Printed, "\tfrs");

  Printed.clear();
  raw_string_ostream IncjospOS(Printed);
  InstPrinter->printInst(&Incjosp, /*Address=*/0, /*Annot=*/"", *STI,
                         IncjospOS);
  IncjospOS.flush();
  EXPECT_EQ(Printed, "\tincjosp\t-1");

  Printed.clear();
  raw_string_ostream IcallOS(Printed);
  InstPrinter->printInst(&Icall, /*Address=*/0, /*Annot=*/"", *STI, IcallOS);
  IcallOS.flush();
  EXPECT_EQ(Printed, "\ticall\tr1");

  Printed.clear();
  raw_string_ostream LslOS(Printed);
  InstPrinter->printInst(&Lsl, /*Address=*/0, /*Annot=*/"", *STI, LslOS);
  LslOS.flush();
  EXPECT_EQ(Printed, "\tlsl\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream LsrOS(Printed);
  InstPrinter->printInst(&Lsr, /*Address=*/0, /*Annot=*/"", *STI, LsrOS);
  LsrOS.flush();
  EXPECT_EQ(Printed, "\tlsr\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MaxOS(Printed);
  InstPrinter->printInst(&Max, /*Address=*/0, /*Annot=*/"", *STI, MaxOS);
  MaxOS.flush();
  EXPECT_EQ(Printed, "\tmax\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MinOS(Printed);
  InstPrinter->printInst(&Min, /*Address=*/0, /*Annot=*/"", *STI, MinOS);
  MinOS.flush();
  EXPECT_EQ(Printed, "\tmin\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MfdrOS(Printed);
  InstPrinter->printInst(&Mfdr, /*Address=*/0, /*Annot=*/"", *STI, MfdrOS);
  MfdrOS.flush();
  EXPECT_EQ(Printed, "\tmfdr\tr1, 4");

  Printed.clear();
  raw_string_ostream MfsrOS(Printed);
  InstPrinter->printInst(&Mfsr, /*Address=*/0, /*Annot=*/"", *STI, MfsrOS);
  MfsrOS.flush();
  EXPECT_EQ(Printed, "\tmfsr\tr1, 4");

  Printed.clear();
  raw_string_ostream MulCompactOS(Printed);
  InstPrinter->printInst(&MulCompact, /*Address=*/0, /*Annot=*/"", *STI,
                         MulCompactOS);
  MulCompactOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2");

  Printed.clear();
  raw_string_ostream MulImmOS(Printed);
  InstPrinter->printInst(&MulImm, /*Address=*/0, /*Annot=*/"", *STI,
                         MulImmOS);
  MulImmOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, -1");

  Printed.clear();
  raw_string_ostream MulOS(Printed);
  InstPrinter->printInst(&Mul, /*Address=*/0, /*Annot=*/"", *STI, MulOS);
  MulOS.flush();
  EXPECT_EQ(Printed, "\tmul\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream MulsDOS(Printed);
  InstPrinter->printInst(&MulsD, /*Address=*/0, /*Annot=*/"", *STI, MulsDOS);
  MulsDOS.flush();
  EXPECT_EQ(Printed, "\tmuls.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MuluDOS(Printed);
  InstPrinter->printInst(&MuluD, /*Address=*/0, /*Annot=*/"", *STI, MuluDOS);
  MuluDOS.flush();
  EXPECT_EQ(Printed, "\tmulu.d\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream DivsOS(Printed);
  InstPrinter->printInst(&Divs, /*Address=*/0, /*Annot=*/"", *STI, DivsOS);
  DivsOS.flush();
  EXPECT_EQ(Printed, "\tdivs\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream DivuOS(Printed);
  InstPrinter->printInst(&Divu, /*Address=*/0, /*Annot=*/"", *STI, DivuOS);
  DivuOS.flush();
  EXPECT_EQ(Printed, "\tdivu\tr2, r3, r4");

  Printed.clear();
  raw_string_ostream MusfrOS(Printed);
  InstPrinter->printInst(&Musfr, /*Address=*/0, /*Annot=*/"", *STI, MusfrOS);
  MusfrOS.flush();
  EXPECT_EQ(Printed, "\tmusfr\tr1");

  Printed.clear();
  raw_string_ostream MustrOS(Printed);
  InstPrinter->printInst(&Mustr, /*Address=*/0, /*Annot=*/"", *STI, MustrOS);
  MustrOS.flush();
  EXPECT_EQ(Printed, "\tmustr\tr1");

  Printed.clear();
  raw_string_ostream MtdrOS(Printed);
  InstPrinter->printInst(&Mtdr, /*Address=*/0, /*Annot=*/"", *STI, MtdrOS);
  MtdrOS.flush();
  EXPECT_EQ(Printed, "\tmtdr\t4, r1");

  Printed.clear();
  raw_string_ostream MtsrOS(Printed);
  InstPrinter->printInst(&Mtsr, /*Address=*/0, /*Annot=*/"", *STI, MtsrOS);
  MtsrOS.flush();
  EXPECT_EQ(Printed, "\tmtsr\t4, r1");

  Printed.clear();
  raw_string_ostream OrOS(Printed);
  InstPrinter->printInst(&Or, /*Address=*/0, /*Annot=*/"", *STI, OrOS);
  OrOS.flush();
  EXPECT_EQ(Printed, "\tor\tr1, r2");

  Printed.clear();
  raw_string_ostream OrhOS(Printed);
  InstPrinter->printInst(&Orh, /*Address=*/0, /*Annot=*/"", *STI, OrhOS);
  OrhOS.flush();
  EXPECT_EQ(Printed, "\torh\tr1, 1");

  Printed.clear();
  raw_string_ostream OrlOS(Printed);
  InstPrinter->printInst(&Orl, /*Address=*/0, /*Annot=*/"", *STI, OrlOS);
  OrlOS.flush();
  EXPECT_EQ(Printed, "\torl\tr1, 1");

  Printed.clear();
  raw_string_ostream OrEqOS(Printed);
  InstPrinter->printInst(&OrEq, /*Address=*/0, /*Annot=*/"", *STI, OrEqOS);
  OrEqOS.flush();
  EXPECT_EQ(Printed, "\toreq\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream OrAlOS(Printed);
  InstPrinter->printInst(&OrAl, /*Address=*/0, /*Annot=*/"", *STI, OrAlOS);
  OrAlOS.flush();
  EXPECT_EQ(Printed, "\toral\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream PopjcOS(Printed);
  InstPrinter->printInst(&Popjc, /*Address=*/0, /*Annot=*/"", *STI, PopjcOS);
  PopjcOS.flush();
  EXPECT_EQ(Printed, "\tpopjc");

  Printed.clear();
  raw_string_ostream PushjcOS(Printed);
  InstPrinter->printInst(&Pushjc, /*Address=*/0, /*Annot=*/"", *STI,
                         PushjcOS);
  PushjcOS.flush();
  EXPECT_EQ(Printed, "\tpushjc");

  Printed.clear();
  raw_string_ostream RetdOS(Printed);
  InstPrinter->printInst(&Retd, /*Address=*/0, /*Annot=*/"", *STI, RetdOS);
  RetdOS.flush();
  EXPECT_EQ(Printed, "\tretd");

  Printed.clear();
  raw_string_ostream ReteOS(Printed);
  InstPrinter->printInst(&Rete, /*Address=*/0, /*Annot=*/"", *STI, ReteOS);
  ReteOS.flush();
  EXPECT_EQ(Printed, "\trete");

