cozycactus/llvm-project/llvm/unittests/Target/AVR32/TargetInfoTest.cpp
  Printed.clear();
  raw_string_ostream RetalOS(Printed);
  InstPrinter->printInst(&Retal, /*Address=*/0, /*Annot=*/"", *STI, RetalOS);
  RetalOS.flush();
  EXPECT_EQ(Printed, "\tretal\tlr");

  Printed.clear();
  raw_string_ostream RetccOS(Printed);
  InstPrinter->printInst(&Retcc, /*Address=*/0, /*Annot=*/"", *STI, RetccOS);
  RetccOS.flush();
  EXPECT_EQ(Printed, "\tretcc\tlr");

  Printed.clear();
  raw_string_ostream RetcsOS(Printed);
  InstPrinter->printInst(&Retcs, /*Address=*/0, /*Annot=*/"", *STI, RetcsOS);
  RetcsOS.flush();
  EXPECT_EQ(Printed, "\tretcs\tlr");

  Printed.clear();
  raw_string_ostream RetloOS(Printed);
  InstPrinter->printInst(&Retlo, /*Address=*/0, /*Annot=*/"", *STI, RetloOS);
  RetloOS.flush();
  EXPECT_EQ(Printed, "\tretlo\tlr");

  Printed.clear();
  raw_string_ostream RetgeOS(Printed);
  InstPrinter->printInst(&Retge, /*Address=*/0, /*Annot=*/"", *STI, RetgeOS);
  RetgeOS.flush();
  EXPECT_EQ(Printed, "\tretge\tlr");

  Printed.clear();
  raw_string_ostream RetltOS(Printed);
  InstPrinter->printInst(&Retlt, /*Address=*/0, /*Annot=*/"", *STI, RetltOS);
  RetltOS.flush();
  EXPECT_EQ(Printed, "\tretlt\tlr");

  Printed.clear();
  raw_string_ostream RetmiOS(Printed);
  InstPrinter->printInst(&Retmi, /*Address=*/0, /*Annot=*/"", *STI, RetmiOS);
  RetmiOS.flush();
  EXPECT_EQ(Printed, "\tretmi\tlr");

  Printed.clear();
  raw_string_ostream RetplOS(Printed);
  InstPrinter->printInst(&Retpl, /*Address=*/0, /*Annot=*/"", *STI, RetplOS);
  RetplOS.flush();
  EXPECT_EQ(Printed, "\tretpl\tlr");

  Printed.clear();
  raw_string_ostream RetlsOS(Printed);
  InstPrinter->printInst(&Retls, /*Address=*/0, /*Annot=*/"", *STI, RetlsOS);
  RetlsOS.flush();
  EXPECT_EQ(Printed, "\tretls\tlr");

  Printed.clear();
  raw_string_ostream RetgtOS(Printed);
  InstPrinter->printInst(&Retgt, /*Address=*/0, /*Annot=*/"", *STI, RetgtOS);
  RetgtOS.flush();
  EXPECT_EQ(Printed, "\tretgt\tlr");

  Printed.clear();
  raw_string_ostream RetleOS(Printed);
  InstPrinter->printInst(&Retle, /*Address=*/0, /*Annot=*/"", *STI, RetleOS);
  RetleOS.flush();
  EXPECT_EQ(Printed, "\tretle\tlr");

  Printed.clear();
  raw_string_ostream RethiOS(Printed);
  InstPrinter->printInst(&Rethi, /*Address=*/0, /*Annot=*/"", *STI, RethiOS);
  RethiOS.flush();
  EXPECT_EQ(Printed, "\trethi\tlr");

  Printed.clear();
  raw_string_ostream RetvsOS(Printed);
  InstPrinter->printInst(&Retvs, /*Address=*/0, /*Annot=*/"", *STI, RetvsOS);
  RetvsOS.flush();
  EXPECT_EQ(Printed, "\tretvs\tlr");

  Printed.clear();
  raw_string_ostream RetvcOS(Printed);
  InstPrinter->printInst(&Retvc, /*Address=*/0, /*Annot=*/"", *STI, RetvcOS);
  RetvcOS.flush();
  EXPECT_EQ(Printed, "\tretvc\tlr");

  Printed.clear();
  raw_string_ostream RetqsOS(Printed);
  InstPrinter->printInst(&Retqs, /*Address=*/0, /*Annot=*/"", *STI, RetqsOS);
  RetqsOS.flush();
  EXPECT_EQ(Printed, "\tretqs\tlr");

  Printed.clear();
  raw_string_ostream RethsOS(Printed);
  InstPrinter->printInst(&Reths, /*Address=*/0, /*Annot=*/"", *STI, RethsOS);
  RethsOS.flush();
  EXPECT_EQ(Printed, "\treths\tlr");

  Printed.clear();
  raw_string_ostream ReteqOS(Printed);
  InstPrinter->printInst(&Reteq, /*Address=*/0, /*Annot=*/"", *STI, ReteqOS);
  ReteqOS.flush();
  EXPECT_EQ(Printed, "\treteq\tlr");

  Printed.clear();
  raw_string_ostream RetneOS(Printed);
  InstPrinter->printInst(&Retne, /*Address=*/0, /*Annot=*/"", *STI, RetneOS);
  RetneOS.flush();
  EXPECT_EQ(Printed, "\tretne\tlr");

  Printed.clear();
  raw_string_ostream RetjOS(Printed);
  InstPrinter->printInst(&Retj, /*Address=*/0, /*Annot=*/"", *STI, RetjOS);
  RetjOS.flush();
  EXPECT_EQ(Printed, "\tretj");

  Printed.clear();
  raw_string_ostream RetsOS(Printed);
  InstPrinter->printInst(&Rets, /*Address=*/0, /*Annot=*/"", *STI, RetsOS);
  RetsOS.flush();
  EXPECT_EQ(Printed, "\trets");

  Printed.clear();
  raw_string_ostream RetssOS(Printed);
  InstPrinter->printInst(&Retss, /*Address=*/0, /*Annot=*/"", *STI, RetssOS);
  RetssOS.flush();
  EXPECT_EQ(Printed, "\tretss");

  Printed.clear();
  raw_string_ostream RolOS(Printed);
  InstPrinter->printInst(&Rol, /*Address=*/0, /*Annot=*/"", *STI, RolOS);
  RolOS.flush();
  EXPECT_EQ(Printed, "\trol\tr1");

  Printed.clear();
  raw_string_ostream RorOS(Printed);
  InstPrinter->printInst(&Ror, /*Address=*/0, /*Annot=*/"", *STI, RorOS);
  RorOS.flush();
  EXPECT_EQ(Printed, "\tror\tr1");

  Printed.clear();
  raw_string_ostream RsubOS(Printed);
  InstPrinter->printInst(&Rsub, /*Address=*/0, /*Annot=*/"", *STI, RsubOS);
  RsubOS.flush();
  EXPECT_EQ(Printed, "\trsub\tr1, r2");

  Printed.clear();
  raw_string_ostream SbcOS(Printed);
  InstPrinter->printInst(&Sbc, /*Address=*/0, /*Annot=*/"", *STI, SbcOS);
  SbcOS.flush();
  EXPECT_EQ(Printed, "\tsbc\tr1, r2, r3");

  Printed.clear();
  raw_string_ostream SbrOS(Printed);
  InstPrinter->printInst(&Sbr, /*Address=*/0, /*Annot=*/"", *STI, SbrOS);
  SbrOS.flush();
  EXPECT_EQ(Printed, "\tsbr\tr1, 1");

  Printed.clear();
  raw_string_ostream ScallOS(Printed);
  InstPrinter->printInst(&Scall, /*Address=*/0, /*Annot=*/"", *STI, ScallOS);
  ScallOS.flush();
  EXPECT_EQ(Printed, "\tscall");

  Printed.clear();
  raw_string_ostream SscallOS(Printed);
  InstPrinter->printInst(&Sscall, /*Address=*/0, /*Annot=*/"", *STI,
                         SscallOS);
  SscallOS.flush();
  EXPECT_EQ(Printed, "\tsscall");

  Printed.clear();
  raw_string_ostream ScrOS(Printed);
  InstPrinter->printInst(&Scr, /*Address=*/0, /*Annot=*/"", *STI, ScrOS);
  ScrOS.flush();
  EXPECT_EQ(Printed, "\tscr\tr1");

  Printed.clear();
  raw_string_ostream SrEqOS(Printed);
  InstPrinter->printInst(&SrEq, /*Address=*/0, /*Annot=*/"", *STI, SrEqOS);
  SrEqOS.flush();
  EXPECT_EQ(Printed, "\tsreq\tr1");

  Printed.clear();
  raw_string_ostream SrAlOS(Printed);
  InstPrinter->printInst(&SrAl, /*Address=*/0, /*Annot=*/"", *STI, SrAlOS);
  SrAlOS.flush();
  EXPECT_EQ(Printed, "\tsral\tr1");

  Printed.clear();
  raw_string_ostream SleepOS(Printed);
  InstPrinter->printInst(&Sleep, /*Address=*/0, /*Annot=*/"", *STI, SleepOS);
  SleepOS.flush();
  EXPECT_EQ(Printed, "\tsleep\t1");

